{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19, 19, 18], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "init_conv_block", "class_name": "Conv2D", "config": {"name": "init_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "init_batch_norm", "class_name": "BatchNormalization", "config": {"name": "init_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["init_conv_block", 0, 0, {}]]]}, {"name": "b_init_relu", "class_name": "Activation", "config": {"name": "b_init_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["init_batch_norm", 0, 0, {}]]]}, {"name": "residual_1_0_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_0_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_init_relu", 0, 0, {}]]]}, {"name": "residual_1_0_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_0_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_0_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_0_relu", "class_name": "Activation", "config": {"name": "b_residual_1_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_0_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_0_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_0_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_0_relu", 0, 0, {}]]]}, {"name": "residual_2_0_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_0_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_0_conv_block", 0, 0, {}]]]}, {"name": "add_0", "class_name": "Add", "config": {"name": "add_0", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_init_relu", 0, 0, {}], ["residual_2_0_batch_norm", 0, 0, {}]]]}, {"name": "b_0_relu", "class_name": "Activation", "config": {"name": "b_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_0", 0, 0, {}]]]}, {"name": "residual_1_1_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_1_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_0_relu", 0, 0, {}]]]}, {"name": "residual_1_1_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_1_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_1_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_1_relu", "class_name": "Activation", "config": {"name": "b_residual_1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_1_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_1_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_1_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_1_relu", 0, 0, {}]]]}, {"name": "residual_2_1_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_1_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_1_conv_block", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_0_relu", 0, 0, {}], ["residual_2_1_batch_norm", 0, 0, {}]]]}, {"name": "b_1_relu", "class_name": "Activation", "config": {"name": "b_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "residual_1_2_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_2_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_1_relu", 0, 0, {}]]]}, {"name": "residual_1_2_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_2_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_2_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_2_relu", "class_name": "Activation", "config": {"name": "b_residual_1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_2_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_2_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_2_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_2_relu", 0, 0, {}]]]}, {"name": "residual_2_2_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_2_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_2_conv_block", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_1_relu", 0, 0, {}], ["residual_2_2_batch_norm", 0, 0, {}]]]}, {"name": "b_2_relu", "class_name": "Activation", "config": {"name": "b_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "residual_1_3_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_3_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_2_relu", 0, 0, {}]]]}, {"name": "residual_1_3_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_3_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_3_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_3_relu", "class_name": "Activation", "config": {"name": "b_residual_1_3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_3_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_3_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_3_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_3_relu", 0, 0, {}]]]}, {"name": "residual_2_3_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_3_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_3_conv_block", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_2_relu", 0, 0, {}], ["residual_2_3_batch_norm", 0, 0, {}]]]}, {"name": "b_3_relu", "class_name": "Activation", "config": {"name": "b_3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "residual_1_4_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_4_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_3_relu", 0, 0, {}]]]}, {"name": "residual_1_4_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_4_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_4_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_4_relu", "class_name": "Activation", "config": {"name": "b_residual_1_4_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_4_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_4_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_4_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_4_relu", 0, 0, {}]]]}, {"name": "residual_2_4_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_4_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_4_conv_block", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_3_relu", 0, 0, {}], ["residual_2_4_batch_norm", 0, 0, {}]]]}, {"name": "b_4_relu", "class_name": "Activation", "config": {"name": "b_4_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "residual_1_5_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_5_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_4_relu", 0, 0, {}]]]}, {"name": "residual_1_5_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_5_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_5_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_5_relu", "class_name": "Activation", "config": {"name": "b_residual_1_5_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_5_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_5_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_5_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_5_relu", 0, 0, {}]]]}, {"name": "residual_2_5_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_5_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_5_conv_block", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_4_relu", 0, 0, {}], ["residual_2_5_batch_norm", 0, 0, {}]]]}, {"name": "b_5_relu", "class_name": "Activation", "config": {"name": "b_5_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "residual_1_6_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_6_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_5_relu", 0, 0, {}]]]}, {"name": "residual_1_6_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_6_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_6_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_6_relu", "class_name": "Activation", "config": {"name": "b_residual_1_6_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_6_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_6_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_6_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_6_relu", 0, 0, {}]]]}, {"name": "residual_2_6_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_6_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_6_conv_block", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_5_relu", 0, 0, {}], ["residual_2_6_batch_norm", 0, 0, {}]]]}, {"name": "b_6_relu", "class_name": "Activation", "config": {"name": "b_6_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "residual_1_7_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_7_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_6_relu", 0, 0, {}]]]}, {"name": "residual_1_7_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_7_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_7_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_7_relu", "class_name": "Activation", "config": {"name": "b_residual_1_7_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_7_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_7_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_7_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_7_relu", 0, 0, {}]]]}, {"name": "residual_2_7_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_7_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_7_conv_block", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_6_relu", 0, 0, {}], ["residual_2_7_batch_norm", 0, 0, {}]]]}, {"name": "b_7_relu", "class_name": "Activation", "config": {"name": "b_7_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "residual_1_8_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_8_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_7_relu", 0, 0, {}]]]}, {"name": "residual_1_8_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_8_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_8_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_8_relu", "class_name": "Activation", "config": {"name": "b_residual_1_8_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_8_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_8_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_8_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_8_relu", 0, 0, {}]]]}, {"name": "residual_2_8_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_8_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_8_conv_block", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_7_relu", 0, 0, {}], ["residual_2_8_batch_norm", 0, 0, {}]]]}, {"name": "b_8_relu", "class_name": "Activation", "config": {"name": "b_8_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "residual_1_9_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_9_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_8_relu", 0, 0, {}]]]}, {"name": "residual_1_9_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_9_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_9_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_9_relu", "class_name": "Activation", "config": {"name": "b_residual_1_9_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_9_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_9_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_9_conv_block", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_9_relu", 0, 0, {}]]]}, {"name": "residual_2_9_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_9_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_9_conv_block", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_8_relu", 0, 0, {}], ["residual_2_9_batch_norm", 0, 0, {}]]]}, {"name": "b_9_relu", "class_name": "Activation", "config": {"name": "b_9_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "value_head_conv_block", "class_name": "Conv2D", "config": {"name": "value_head_conv_block", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_9_relu", 0, 0, {}]]]}, {"name": "policy_head_conv_block", "class_name": "Conv2D", "config": {"name": "policy_head_conv_block", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_9_relu", 0, 0, {}]]]}, {"name": "value_head_batch_norm", "class_name": "BatchNormalization", "config": {"name": "value_head_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["value_head_conv_block", 0, 0, {}]]]}, {"name": "policy_head_batch_norm", "class_name": "BatchNormalization", "config": {"name": "policy_head_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["policy_head_conv_block", 0, 0, {}]]]}, {"name": "value_head_relu", "class_name": "Activation", "config": {"name": "value_head_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["value_head_batch_norm", 0, 0, {}]]]}, {"name": "policy_head_relu", "class_name": "Activation", "config": {"name": "policy_head_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["policy_head_batch_norm", 0, 0, {}]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "inbound_nodes": [[["value_head_relu", 0, 0, {}]]]}, {"name": "permute", "class_name": "Permute", "config": {"name": "permute", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "inbound_nodes": [[["policy_head_relu", 0, 0, {}]]]}, {"name": "value_head_flatten", "class_name": "Flatten", "config": {"name": "value_head_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"name": "policy_flatten", "class_name": "Flatten", "config": {"name": "policy_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["permute", 0, 0, {}]]]}, {"name": "value_head_dense", "class_name": "Dense", "config": {"name": "value_head_dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["value_head_flatten", 0, 0, {}]]]}, {"name": "policy_head_dense", "class_name": "Dense", "config": {"name": "policy_head_dense", "trainable": true, "dtype": "float32", "units": 362, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["policy_flatten", 0, 0, {}]]]}, {"name": "value_head_output", "class_name": "Dense", "config": {"name": "value_head_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["value_head_dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_head_dense", 0, 0], ["value_head_output", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "init_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "init_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "init_conv_block/kernel", "shape": [3, 3, 18, 128], "dtype": "float32"}, {"name": "init_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "policy_head_batch_norm/moving_mean", "shape": [2], "dtype": "float32"}, {"name": "policy_head_batch_norm/moving_variance", "shape": [2], "dtype": "float32"}, {"name": "policy_head_conv_block/kernel", "shape": [1, 1, 128, 2], "dtype": "float32"}, {"name": "policy_head_conv_block/bias", "shape": [2], "dtype": "float32"}, {"name": "policy_head_dense/kernel", "shape": [722, 362], "dtype": "float32"}, {"name": "policy_head_dense/bias", "shape": [362], "dtype": "float32"}, {"name": "residual_1_0_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_0_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_0_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_0_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_1_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_1_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_1_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_1_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_2_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_2_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_2_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_2_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_3_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_3_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_3_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_3_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_4_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_4_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_4_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_4_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_5_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_5_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_5_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_5_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_6_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_6_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_6_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_6_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_7_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_7_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_7_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_7_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_8_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_8_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_8_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_8_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_1_9_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_1_9_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_1_9_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_1_9_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_0_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_0_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_0_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_0_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_1_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_1_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_1_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_1_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_2_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_2_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_2_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_2_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_3_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_3_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_3_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_3_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_4_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_4_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_4_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_4_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_5_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_5_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_5_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_5_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_6_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_6_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_6_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_6_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_7_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_7_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_7_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_7_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_8_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_8_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_8_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_8_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "residual_2_9_batch_norm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "residual_2_9_batch_norm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "residual_2_9_conv_block/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "residual_2_9_conv_block/bias", "shape": [128], "dtype": "float32"}, {"name": "value_head_batch_norm/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "value_head_batch_norm/moving_variance", "shape": [1], "dtype": "float32"}, {"name": "value_head_conv_block/kernel", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "value_head_conv_block/bias", "shape": [1], "dtype": "float32"}, {"name": "value_head_dense/kernel", "shape": [361, 256], "dtype": "float32"}, {"name": "value_head_dense/bias", "shape": [256], "dtype": "float32"}, {"name": "value_head_output/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "value_head_output/bias", "shape": [1], "dtype": "float32"}]}]}