{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19, 19, 18], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "init_conv_block", "class_name": "Conv2D", "config": {"name": "init_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "init_batch_norm", "class_name": "BatchNormalization", "config": {"name": "init_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["init_conv_block", 0, 0, {}]]]}, {"name": "b_init_relu", "class_name": "Activation", "config": {"name": "b_init_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["init_batch_norm", 0, 0, {}]]]}, {"name": "residual_1_0_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_0_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_init_relu", 0, 0, {}]]]}, {"name": "residual_1_0_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_0_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_0_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_0_relu", "class_name": "Activation", "config": {"name": "b_residual_1_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_0_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_0_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_0_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_0_relu", 0, 0, {}]]]}, {"name": "residual_2_0_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_0_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_0_conv_block", 0, 0, {}]]]}, {"name": "add_0", "class_name": "Add", "config": {"name": "add_0", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_init_relu", 0, 0, {}], ["residual_2_0_batch_norm", 0, 0, {}]]]}, {"name": "b_0_relu", "class_name": "Activation", "config": {"name": "b_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_0", 0, 0, {}]]]}, {"name": "residual_1_1_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_1_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_0_relu", 0, 0, {}]]]}, {"name": "residual_1_1_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_1_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_1_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_1_relu", "class_name": "Activation", "config": {"name": "b_residual_1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_1_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_1_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_1_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_1_relu", 0, 0, {}]]]}, {"name": "residual_2_1_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_1_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_1_conv_block", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_0_relu", 0, 0, {}], ["residual_2_1_batch_norm", 0, 0, {}]]]}, {"name": "b_1_relu", "class_name": "Activation", "config": {"name": "b_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "residual_1_2_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_2_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_1_relu", 0, 0, {}]]]}, {"name": "residual_1_2_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_2_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_2_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_2_relu", "class_name": "Activation", "config": {"name": "b_residual_1_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_2_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_2_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_2_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_2_relu", 0, 0, {}]]]}, {"name": "residual_2_2_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_2_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_2_conv_block", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_1_relu", 0, 0, {}], ["residual_2_2_batch_norm", 0, 0, {}]]]}, {"name": "b_2_relu", "class_name": "Activation", "config": {"name": "b_2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "residual_1_3_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_3_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_2_relu", 0, 0, {}]]]}, {"name": "residual_1_3_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_3_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_3_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_3_relu", "class_name": "Activation", "config": {"name": "b_residual_1_3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_3_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_3_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_3_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_3_relu", 0, 0, {}]]]}, {"name": "residual_2_3_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_3_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_3_conv_block", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_2_relu", 0, 0, {}], ["residual_2_3_batch_norm", 0, 0, {}]]]}, {"name": "b_3_relu", "class_name": "Activation", "config": {"name": "b_3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "residual_1_4_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_4_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_3_relu", 0, 0, {}]]]}, {"name": "residual_1_4_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_4_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_4_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_4_relu", "class_name": "Activation", "config": {"name": "b_residual_1_4_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_4_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_4_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_4_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_4_relu", 0, 0, {}]]]}, {"name": "residual_2_4_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_4_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_4_conv_block", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_3_relu", 0, 0, {}], ["residual_2_4_batch_norm", 0, 0, {}]]]}, {"name": "b_4_relu", "class_name": "Activation", "config": {"name": "b_4_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "residual_1_5_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_5_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_4_relu", 0, 0, {}]]]}, {"name": "residual_1_5_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_5_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_5_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_5_relu", "class_name": "Activation", "config": {"name": "b_residual_1_5_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_5_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_5_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_5_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_5_relu", 0, 0, {}]]]}, {"name": "residual_2_5_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_5_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_5_conv_block", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_4_relu", 0, 0, {}], ["residual_2_5_batch_norm", 0, 0, {}]]]}, {"name": "b_5_relu", "class_name": "Activation", "config": {"name": "b_5_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "residual_1_6_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_6_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_5_relu", 0, 0, {}]]]}, {"name": "residual_1_6_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_6_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_6_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_6_relu", "class_name": "Activation", "config": {"name": "b_residual_1_6_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_6_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_6_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_6_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_6_relu", 0, 0, {}]]]}, {"name": "residual_2_6_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_6_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_6_conv_block", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_5_relu", 0, 0, {}], ["residual_2_6_batch_norm", 0, 0, {}]]]}, {"name": "b_6_relu", "class_name": "Activation", "config": {"name": "b_6_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "residual_1_7_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_7_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_6_relu", 0, 0, {}]]]}, {"name": "residual_1_7_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_7_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_7_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_7_relu", "class_name": "Activation", "config": {"name": "b_residual_1_7_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_7_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_7_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_7_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_7_relu", 0, 0, {}]]]}, {"name": "residual_2_7_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_7_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_7_conv_block", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_6_relu", 0, 0, {}], ["residual_2_7_batch_norm", 0, 0, {}]]]}, {"name": "b_7_relu", "class_name": "Activation", "config": {"name": "b_7_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "residual_1_8_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_8_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_7_relu", 0, 0, {}]]]}, {"name": "residual_1_8_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_8_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_8_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_8_relu", "class_name": "Activation", "config": {"name": "b_residual_1_8_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_8_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_8_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_8_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_8_relu", 0, 0, {}]]]}, {"name": "residual_2_8_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_8_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_8_conv_block", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_7_relu", 0, 0, {}], ["residual_2_8_batch_norm", 0, 0, {}]]]}, {"name": "b_8_relu", "class_name": "Activation", "config": {"name": "b_8_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "residual_1_9_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_9_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_8_relu", 0, 0, {}]]]}, {"name": "residual_1_9_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_9_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_9_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_9_relu", "class_name": "Activation", "config": {"name": "b_residual_1_9_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_9_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_9_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_9_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_9_relu", 0, 0, {}]]]}, {"name": "residual_2_9_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_9_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_9_conv_block", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_8_relu", 0, 0, {}], ["residual_2_9_batch_norm", 0, 0, {}]]]}, {"name": "b_9_relu", "class_name": "Activation", "config": {"name": "b_9_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "residual_1_10_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_10_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_9_relu", 0, 0, {}]]]}, {"name": "residual_1_10_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_10_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_10_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_10_relu", "class_name": "Activation", "config": {"name": "b_residual_1_10_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_10_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_10_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_10_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_10_relu", 0, 0, {}]]]}, {"name": "residual_2_10_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_10_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_10_conv_block", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_9_relu", 0, 0, {}], ["residual_2_10_batch_norm", 0, 0, {}]]]}, {"name": "b_10_relu", "class_name": "Activation", "config": {"name": "b_10_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "residual_1_11_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_11_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_10_relu", 0, 0, {}]]]}, {"name": "residual_1_11_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_11_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_11_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_11_relu", "class_name": "Activation", "config": {"name": "b_residual_1_11_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_11_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_11_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_11_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_11_relu", 0, 0, {}]]]}, {"name": "residual_2_11_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_11_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_11_conv_block", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_10_relu", 0, 0, {}], ["residual_2_11_batch_norm", 0, 0, {}]]]}, {"name": "b_11_relu", "class_name": "Activation", "config": {"name": "b_11_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "residual_1_12_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_12_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_11_relu", 0, 0, {}]]]}, {"name": "residual_1_12_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_12_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_12_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_12_relu", "class_name": "Activation", "config": {"name": "b_residual_1_12_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_12_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_12_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_12_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_12_relu", 0, 0, {}]]]}, {"name": "residual_2_12_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_12_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_12_conv_block", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_11_relu", 0, 0, {}], ["residual_2_12_batch_norm", 0, 0, {}]]]}, {"name": "b_12_relu", "class_name": "Activation", "config": {"name": "b_12_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "residual_1_13_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_13_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_12_relu", 0, 0, {}]]]}, {"name": "residual_1_13_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_13_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_13_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_13_relu", "class_name": "Activation", "config": {"name": "b_residual_1_13_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_13_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_13_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_13_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_13_relu", 0, 0, {}]]]}, {"name": "residual_2_13_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_13_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_13_conv_block", 0, 0, {}]]]}, {"name": "add_13", "class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_12_relu", 0, 0, {}], ["residual_2_13_batch_norm", 0, 0, {}]]]}, {"name": "b_13_relu", "class_name": "Activation", "config": {"name": "b_13_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"name": "residual_1_14_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_14_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_13_relu", 0, 0, {}]]]}, {"name": "residual_1_14_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_1_14_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_1_14_conv_block", 0, 0, {}]]]}, {"name": "b_residual_1_14_relu", "class_name": "Activation", "config": {"name": "b_residual_1_14_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["residual_1_14_batch_norm", 0, 0, {}]]]}, {"name": "residual_2_14_conv_block", "class_name": "Conv2D", "config": {"name": "residual_2_14_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["b_residual_1_14_relu", 0, 0, {}]]]}, {"name": "residual_2_14_batch_norm", "class_name": "BatchNormalization", "config": {"name": "residual_2_14_batch_norm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1e-05, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["residual_2_14_conv_block", 0, 0, {}]]]}, {"name": "add_14", "class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["b_13_relu", 0, 0, {}], ["residual_2_14_batch_norm", 0, 0, {}]]]}, {"name": "b_14_relu", "class_name": "Activation", "config": {"name": "b_14_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"name": "residual_1_15_conv_block", "class_name": "Conv2D", "config": {"name": "residual_1_15_conv_block", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": 